# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# 	Пример:
# 	- 6782 -> 23
# 	- 0,56 -> 11



number = str(input("Введите вещественное число = "))
# res = 0                           #Было
# for i in range(len(number)):  
#     if number[i].isdigit():
#         res += int(number[i])
#print(res)

print(sum([int(num) for num in number if num.isdigit()]))   #стало

#{•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••}




